In [2]:
pwd #check working directory

'/home/dsxuser/work'

In [5]:
#import GDP data
import types
import pandas as pd
from botocore.client import Config
import ibm_boto3

def __iter__(self): return 0

# @hidden_cell
# The following code accesses a file in your IBM Cloud Object Storage. It includes your credentials.
# You might want to remove those credentials before you share the notebook.
client_61c7475c72374a1b9685e4af09d23afc = ibm_boto3.client(service_name='s3',
    ibm_api_key_id='mF35U0ZTQ_CwRp9e8hK3fgvaENb5n5bKZfYPv4Ec7uiP',
    ibm_auth_endpoint="https://iam.ng.bluemix.net/oidc/token",
    config=Config(signature_version='oauth'),
    endpoint_url='https://s3-api.us-geo.objectstorage.service.networklayer.com')


body = client_61c7475c72374a1b9685e4af09d23afc.get_object(Bucket='jin-donotdelete-pr-he56bked6i8po3',Key='GDP-2.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

data = pd.read_csv(body)
data.head()

         DATE      GDP
0  1948-01-01  265.742
1  1948-04-01  272.567
2  1948-07-01  279.196
3  1948-10-01  280.366
4  1949-01-01  275.034

In [19]:
len(data) #find the length of the data

287

In [ ]:
GDP=data.sort_values (by = "DATE") #sort data

In [21]:
GDP.head() #find first five data

         DATE      GDP
0  1948-01-01  265.742
1  1948-04-01  272.567
2  1948-07-01  279.196
3  1948-10-01  280.366
4  1949-01-01  275.034

In [90]:
GDP1=GDP['GDP'] #extract GDP column

0        265.742
1        272.567
2        279.196
3        280.366
4        275.034
5        271.351
6        272.889
7        270.627
8        280.828
9        290.383
10       308.153
11       319.945
12       336.000
13       344.090
14       351.385
15       356.178
16       359.820
17       361.030
18       367.701
19       380.812
20       387.980
21       391.749
22       391.171
23       385.970
24       385.345
25       386.121
26       390.996
27       399.734
28       413.073
29       421.532
         ...
257    16152.257
258    16257.151
259    16358.863
260    16569.591
261    16637.926
262    16848.748
263    17083.137
264    17104.555
265    17432.909
266    17721.657
267    17849.912
268    17984.178
269    18219.405
270    18344.713
271    18350.825
272    18424.283
273    18637.253
274    18806.743
275    18991.883
276    19190.431
277    19356.649
278    19611.704
279    19918.910
280    20163.159
281    20510.177
282    20749.752
283    20897.804
284    21098.827
285    21340.267
286    21525.819
Name: GDP, Length: 287, dtype: float64

In [91]:
GDP2=GDP1.diff(periods=1) #find quarterly GDP difference by differencing

In [89]:
GDP['GDPDIFF']=GDP2
GDP                #append the GDPDIFF column

           DATE        GDP  GDPDIFF
0    1948-01-01    265.742      NaN
1    1948-04-01    272.567    6.825
2    1948-07-01    279.196    6.629
3    1948-10-01    280.366    1.170
4    1949-01-01    275.034   -5.332
5    1949-04-01    271.351   -3.683
6    1949-07-01    272.889    1.538
7    1949-10-01    270.627   -2.262
8    1950-01-01    280.828   10.201
9    1950-04-01    290.383    9.555
10   1950-07-01    308.153   17.770
11   1950-10-01    319.945   11.792
12   1951-01-01    336.000   16.055
13   1951-04-01    344.090    8.090
14   1951-07-01    351.385    7.295
15   1951-10-01    356.178    4.793
16   1952-01-01    359.820    3.642
17   1952-04-01    361.030    1.210
18   1952-07-01    367.701    6.671
19   1952-10-01    380.812   13.111
20   1953-01-01    387.980    7.168
21   1953-04-01    391.749    3.769
22   1953-07-01    391.171   -0.578
23   1953-10-01    385.970   -5.201
24   1954-01-01    385.345   -0.625
25   1954-04-01    386.121    0.776
26   1954-07-01    390.996    4.875
27   1954-10-01    399.734    8.738
28   1955-01-01    413.073   13.339
29   1955-04-01    421.532    8.459
..          ...        ...      ...
257  2012-04-01  16152.257  132.499
258  2012-07-01  16257.151  104.894
259  2012-10-01  16358.863  101.712
260  2013-01-01  16569.591  210.728
261  2013-04-01  16637.926   68.335
262  2013-07-01  16848.748  210.822
263  2013-10-01  17083.137  234.389
264  2014-01-01  17104.555   21.418
265  2014-04-01  17432.909  328.354
266  2014-07-01  17721.657  288.748
267  2014-10-01  17849.912  128.255
268  2015-01-01  17984.178  134.266
269  2015-04-01  18219.405  235.227
270  2015-07-01  18344.713  125.308
271  2015-10-01  18350.825    6.112
272  2016-01-01  18424.283   73.458
273  2016-04-01  18637.253  212.970
274  2016-07-01  18806.743  169.490
275  2016-10-01  18991.883  185.140
276  2017-01-01  19190.431  198.548
277  2017-04-01  19356.649  166.218
278  2017-07-01  19611.704  255.055
279  2017-10-01  19918.910  307.206
280  2018-01-01  20163.159  244.249
281  2018-04-01  20510.177  347.018
282  2018-07-01  20749.752  239.575
283  2018-10-01  20897.804  148.052
284  2019-01-01  21098.827  201.023
285  2019-04-01  21340.267  241.440
286  2019-07-01  21525.819  185.552

[287 rows x 3 columns]

In [188]:
# import Unemployment rate data
body = client_61c7475c72374a1b9685e4af09d23afc.get_object(Bucket='jin-donotdelete-pr-he56bked6i8po3',Key='UNRATE-2.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like float
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

UNRATE = pd.read_csv(body)
UNRATE.head()

         DATE              UNRATE
0  1948-01-01  3.7333333333333333
1  1948-04-01  3.6666666666666667
2  1948-07-01  3.7666666666666667
3  1948-10-01  3.8333333333333333
4  1949-01-01  4.6666666666666667

In [189]:
len(UNRATE)  # find the lenght of the data

288

In [192]:
UNRATE=UNRATE.drop(UNRATE.index[287])   #drop the last row of the data

In [193]:
UNRATE['UNRATE']=UNRATE['UNRATE'].astype('float')  #change data type

In [194]:
 UNRATE=UNRATE.sort_values(by="DATE") # sort data

In [195]:
UNRATE.head() # find the first 5 data

         DATE    UNRATE
0  1948-01-01  3.733333
1  1948-04-01  3.666667
2  1948-07-01  3.766667
3  1948-10-01  3.833333
4  1949-01-01  4.666667

In [196]:
UNRATE1=UNRATE['UNRATE']  #extract UNRATE data

In [197]:
UNRATE2=UNRATE1.diff(periods=1) #find unemployment change by difference UNRATE

In [199]:
UNRATE['UNRATEDIFF']=UNRATE2
UNRATE             # append UNRATEDIFF

           DATE    UNRATE  UNRATEDIFF
0    1948-01-01  3.733333         NaN
1    1948-04-01  3.666667   -0.066667
2    1948-07-01  3.766667    0.100000
3    1948-10-01  3.833333    0.066667
4    1949-01-01  4.666667    0.833333
5    1949-04-01  5.866667    1.200000
6    1949-07-01  6.700000    0.833333
7    1949-10-01  6.966667    0.266667
8    1950-01-01  6.400000   -0.566667
9    1950-04-01  5.566667   -0.833333
10   1950-07-01  4.633333   -0.933333
11   1950-10-01  4.233333   -0.400000
12   1951-01-01  3.500000   -0.733333
13   1951-04-01  3.100000   -0.400000
14   1951-07-01  3.166667    0.066667
15   1951-10-01  3.366667    0.200000
16   1952-01-01  3.066667   -0.300000
17   1952-04-01  2.966667   -0.100000
18   1952-07-01  3.233333    0.266667
19   1952-10-01  2.833333   -0.400000
20   1953-01-01  2.700000   -0.133333
21   1953-04-01  2.566667   -0.133333
22   1953-07-01  2.733333    0.166667
23   1953-10-01  3.700000    0.966667
24   1954-01-01  5.266667    1.566667
25   1954-04-01  5.800000    0.533333
26   1954-07-01  5.966667    0.166667
27   1954-10-01  5.333333   -0.633333
28   1955-01-01  4.733333   -0.600000
29   1955-04-01  4.400000   -0.333333
..          ...       ...         ...
257  2012-04-01  8.200000   -0.066667
258  2012-07-01  8.033333   -0.166667
259  2012-10-01  7.800000   -0.233333
260  2013-01-01  7.733333   -0.066667
261  2013-04-01  7.533333   -0.200000
262  2013-07-01  7.233333   -0.300000
263  2013-10-01  6.933333   -0.300000
264  2014-01-01  6.666667   -0.266667
265  2014-04-01  6.200000   -0.466667
266  2014-07-01  6.066667   -0.133333
267  2014-10-01  5.700000   -0.366667
268  2015-01-01  5.533333   -0.166667
269  2015-04-01  5.433333   -0.100000
270  2015-07-01  5.100000   -0.333333
271  2015-10-01  5.033333   -0.066667
272  2016-01-01  4.933333   -0.100000
273  2016-04-01  4.900000   -0.033333
274  2016-07-01  4.900000    0.000000
275  2016-10-01  4.766667   -0.133333
276  2017-01-01  4.600000   -0.166667
277  2017-04-01  4.366667   -0.233333
278  2017-07-01  4.300000   -0.066667
279  2017-10-01  4.133333   -0.166667
280  2018-01-01  4.066667   -0.066667
281  2018-04-01  3.900000   -0.166667
282  2018-07-01  3.800000   -0.100000
283  2018-10-01  3.800000    0.000000
284  2019-01-01  3.866667    0.066667
285  2019-04-01  3.633333   -0.233333
286  2019-07-01  3.633333    0.000000

[287 rows x 3 columns]

In [200]:
UNRATE3=UNRATE[UNRATE['UNRATE']>8.5]
UNRATE3

           DATE     UNRATE  UNRATEDIFF
109  1975-04-01   8.866667    0.600000
136  1982-01-01   8.833333    0.600000
137  1982-04-01   9.433333    0.600000
138  1982-07-01   9.900000    0.466667
139  1982-10-01  10.666667    0.766667
140  1983-01-01  10.366667   -0.300000
141  1983-04-01  10.133333   -0.233333
142  1983-07-01   9.366667   -0.766667
143  1983-10-01   8.533333   -0.833333
245  2009-04-01   9.300000    1.033333
246  2009-07-01   9.633333    0.333333
247  2009-10-01   9.933333    0.300000
248  2010-01-01   9.833333   -0.100000
249  2010-04-01   9.633333   -0.200000
250  2010-07-01   9.466667   -0.166667
251  2010-10-01   9.500000    0.033333
252  2011-01-01   9.033333   -0.466667
253  2011-04-01   9.066667    0.033333
254  2011-07-01   9.000000   -0.066667
255  2011-10-01   8.633333   -0.366667

In [215]:
DATE=GDP['DATE'] #create date variable

In [202]:
GDPDIFF=GDP['GDPDIFF']     #extract GDPDIFF and create it as a variable
UNRATEDIFF=UNRATE['UNRATEDIFF'] # extract UNRATEDIFF and create it as a variable

In [203]:
title='GPD Change and Unemployment Rate change'  #create title

In [204]:
from bokeh.plotting import figure, output_file, show #import plotting tool

In [205]:
file_name="index.html" #create file name

In [206]:
def make_dashboard(x, gdp_change, unemployment, title, file_name):
    output_file(file_name)
    p = figure(title=title, x_axis_label='year', y_axis_label='%')
    p.line(x.squeeze(), gdp_change.squeeze(), color="firebrick", line_width=4, legend="% GDP change")
    p.line(x.squeeze(), unemployment.squeeze(), line_width=4, legend="% unemployed")
    show(p)  #define make_dashboard function

In [214]:
make_dashboard(x=DATE,gdp_change=GDPDIFF,unemployment=UNRATEDIFF,title='GPD Change and Unemployment Rate change',file_name="index.html")
#make dashboard